project/app/controllers/web_test/welcome_controller.rb

  def find_dynamic_by_name(name)
    return cont_dynamic.find_dynamic_by_name(name)
---
SELECT "dynamics".* FROM "dynamics" WHERE "dynamics"."name" = $1  [["name", "qualquer"]]