project/app/models/web_test/dynamic.rb

  def self.create_dynamic(params)
    self.create!(
      name: params[:name],
      description: params[:description]
    )
---
INSERT INTO "dynamics" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "qualquer"], ["description", "teste"], ["created_at", "2025-04-07 04:44:29.633873"], ["updated_at", "2025-04-07 04:44:29.633873"]]